```
//name: World Writable Execution - Temp
// description: Detect process execution from C:\Windows\Temp.
// author: ASD's ACSC
DeviceProcessEvents
| where FolderPath startswith "C:\\Windows\\Temp\\" and (not((FolderPath matches regex "(?i)C:\\\\Windows\\\\Temp\\\\\\{[a-fA-F0-9]{8}-([a-fA-F0-9]{4}-){3}[a-fA-F0-9]{12}\\}\\\\" or (AccountName contains "SYSTEM" or AccountName contains "NETWORK SERVICE") or FolderPath endswith "dismhost.exe" or (InitiatingProcessFolderPath endswith "\\esif_uf.exe" or InitiatingProcessFolderPath endswith "\\vmtoolsd.exe" or InitiatingProcessFolderPath endswith "\\cwainstaller.exe" or InitiatingProcessFolderPath endswith "\\trolleyexpress.exe"))))

// name: World Writable Execution - Non-Temp System Subdirectory
// description: Detect process execution from a world writable location in a subdirectory of the Windows OS install location.
// author: ASD's ACSC
SecurityEvent | where (NewProcessName contains @':\\$Recycle.Bin\\' or NewProcessName contains @':\\AMD\\Temp\\' or NewProcessName contains @':\\Intel\\' or NewProcessName contains @':\\PerfLogs\\' or NewProcessName contains @':\\Windows\\addins\\' or NewProcessName contains @':\\Windows\\appcompat\\' or NewProcessName contains @':\\Windows\\apppatch\\' or NewProcessName contains @':\\Windows\\AppReadiness\\' or NewProcessName contains @':\\Windows\\bcastdvr\\' or NewProcessName contains @':\\Windows\\Boot\\' or NewProcessName contains @':\\Windows\\Branding\\' or NewProcessName contains @':\\Windows\\CbsTemp\\' or NewProcessName contains @':\\Windows\\Containers\\' or NewProcessName contains @':\\Windows\\csc\\' or NewProcessName contains @':\\Windows\\Cursors\\' or NewProcessName contains @':\\Windows\\debug\\' or NewProcessName contains @':\\Windows\\diagnostics\\' or NewProcessName contains @':\\Windows\\DigitalLocker\\' or NewProcessName contains @':\\Windows\\dot3svc\\' or NewProcessName contains @':\\Windows\\en-US\\' or NewProcessName contains @':\\Windows\\Fonts\\' or NewProcessName contains @':\\Windows\\Globalization\\' or NewProcessName contains @':\\Windows\\Help\\' or NewProcessName contains @':\\Windows\\IdentityCRL\\' or NewProcessName contains @':\\Windows\\IME\\' or NewProcessName contains @':\\Windows\\ImmersiveControlPanel\\' or NewProcessName contains @':\\Windows\\INF\\' or NewProcessName contains @':\\Windows\\intel\\' or NewProcessName contains @':\\Windows\\L2Schemas\\' or NewProcessName contains @':\\Windows\\LiveKernelReports\\' or NewProcessName contains @':\\Windows\\Logs\\' or NewProcessName contains @':\\Windows\\media\\' or NewProcessName contains @':\\Windows\\Migration\\' or NewProcessName contains @':\\Windows\\ModemLogs\\' or NewProcessName contains @':\\Windows\\ms\\' or NewProcessName contains @':\\Windows\\OCR\\' or NewProcessName contains @':\\Windows\\panther\\' or NewProcessName contains @':\\Windows\\Performance\\' or NewProcessName contains @':\\Windows\\PLA\\' or NewProcessName contains @':\\Windows\\PolicyDefinitions\\' or NewProcessName contains @':\\Windows\\Prefetch\\' or NewProcessName contains @':\\Windows\\PrintDialog\\' or NewProcessName contains @':\\Windows\\Provisioning\\' or NewProcessName contains @':\\Windows\\Registration\\CRMLog\\' or NewProcessName contains @':\\Windows\\RemotePackages\\' or NewProcessName contains @':\\Windows\\rescache\\' or NewProcessName contains @':\\Windows\\Resources\\' or NewProcessName contains @':\\Windows\\SchCache\\' or NewProcessName contains @':\\Windows\\schemas\\' or NewProcessName contains @':\\Windows\\security\\' or NewProcessName contains @':\\Windows\\ServiceState\\' or NewProcessName contains @':\\Windows\\servicing\\' or NewProcessName contains @':\\Windows\\Setup\\' or NewProcessName contains @':\\Windows\\ShellComponents\\' or NewProcessName contains @':\\Windows\\ShellExperiences\\' or NewProcessName contains @':\\Windows\\SKB\\' or NewProcessName contains @':\\Windows\\TAPI\\' or NewProcessName contains @':\\Windows\\Tasks\\' or NewProcessName contains @':\\Windows\\TextInput\\' or NewProcessName contains @':\\Windows\\tracing\\' or NewProcessName contains @':\\Windows\\Vss\\' or NewProcessName contains @':\\Windows\\WaaS\\' or NewProcessName contains @':\\Windows\\Web\\' or NewProcessName contains @':\\Windows\\wlansvc\\' or NewProcessName contains @':\\Windows\\System32\\Com\\dmp\\' or NewProcessName contains @':\\Windows\\System32\\FxsTmp\\' or NewProcessName contains @':\\Windows\\System32\\Microsoft\\Crypto\\RSA\\MachineKeys\\' or NewProcessName contains @':\\Windows\\System32\\Speech\\' or NewProcessName contains @':\\Windows\\System32\\spool\\drivers\\color\\' or NewProcessName contains @':\\Windows\\System32\\spool\\PRINTERS\\' or NewProcessName contains @':\\Windows\\System32\\spool\\SERVERS\\' or NewProcessName contains @':\\Windows\\System32\\Tasks_Migrated\\Microsoft\\Windows\\PLA\\System\\' or NewProcessName contains @':\\Windows\\System32\\Tasks\\' or NewProcessName contains @':\\Windows\\SysWOW64\\Com\\dmp\\' or NewProcessName contains @':\\Windows\\SysWOW64\\FxsTmp\\' or NewProcessName contains @':\\Windows\\SysWOW64\\Tasks\\') and  not ((NewProcessName contains @'\\AppData\\' and Account =~ @'SYSTEM'))

DeviceProcessEvents
| where (FolderPath contains ":\\$Recycle.Bin\\" or FolderPath contains ":\\AMD\\Temp\\" or FolderPath contains ":\\Intel\\" or FolderPath contains ":\\PerfLogs\\" or FolderPath contains ":\\Windows\\addins\\" or FolderPath contains ":\\Windows\\appcompat\\" or FolderPath contains ":\\Windows\\apppatch\\" or FolderPath contains ":\\Windows\\AppReadiness\\" or FolderPath contains ":\\Windows\\bcastdvr\\" or FolderPath contains ":\\Windows\\Boot\\" or FolderPath contains ":\\Windows\\Branding\\" or FolderPath contains ":\\Windows\\CbsTemp\\" or FolderPath contains ":\\Windows\\Containers\\" or FolderPath contains ":\\Windows\\csc\\" or FolderPath contains ":\\Windows\\Cursors\\" or FolderPath contains ":\\Windows\\debug\\" or FolderPath contains ":\\Windows\\diagnostics\\" or FolderPath contains ":\\Windows\\DigitalLocker\\" or FolderPath contains ":\\Windows\\dot3svc\\" or FolderPath contains ":\\Windows\\en-US\\" or FolderPath contains ":\\Windows\\Fonts\\" or FolderPath contains ":\\Windows\\Globalization\\" or FolderPath contains ":\\Windows\\Help\\" or FolderPath contains ":\\Windows\\IdentityCRL\\" or FolderPath contains ":\\Windows\\IME\\" or FolderPath contains ":\\Windows\\ImmersiveControlPanel\\" or FolderPath contains ":\\Windows\\INF\\" or FolderPath contains ":\\Windows\\intel\\" or FolderPath contains ":\\Windows\\L2Schemas\\" or FolderPath contains ":\\Windows\\LiveKernelReports\\" or FolderPath contains ":\\Windows\\Logs\\" or FolderPath contains ":\\Windows\\media\\" or FolderPath contains ":\\Windows\\Migration\\" or FolderPath contains ":\\Windows\\ModemLogs\\" or FolderPath contains ":\\Windows\\ms\\" or FolderPath contains ":\\Windows\\OCR\\" or FolderPath contains ":\\Windows\\panther\\" or FolderPath contains ":\\Windows\\Performance\\" or FolderPath contains ":\\Windows\\PLA\\" or FolderPath contains ":\\Windows\\PolicyDefinitions\\" or FolderPath contains ":\\Windows\\Prefetch\\" or FolderPath contains ":\\Windows\\PrintDialog\\" or FolderPath contains ":\\Windows\\Provisioning\\" or FolderPath contains ":\\Windows\\Registration\\CRMLog\\" or FolderPath contains ":\\Windows\\RemotePackages\\" or FolderPath contains ":\\Windows\\rescache\\" or FolderPath contains ":\\Windows\\Resources\\" or FolderPath contains ":\\Windows\\SchCache\\" or FolderPath contains ":\\Windows\\schemas\\" or FolderPath contains ":\\Windows\\security\\" or FolderPath contains ":\\Windows\\ServiceState\\" or FolderPath contains ":\\Windows\\servicing\\" or FolderPath contains ":\\Windows\\Setup\\" or FolderPath contains ":\\Windows\\ShellComponents\\" or FolderPath contains ":\\Windows\\ShellExperiences\\" or FolderPath contains ":\\Windows\\SKB\\" or FolderPath contains ":\\Windows\\TAPI\\" or FolderPath contains ":\\Windows\\Tasks\\" or FolderPath contains ":\\Windows\\TextInput\\" or FolderPath contains ":\\Windows\\tracing\\" or FolderPath contains ":\\Windows\\Vss\\" or FolderPath contains ":\\Windows\\WaaS\\" or FolderPath contains ":\\Windows\\Web\\" or FolderPath contains ":\\Windows\\wlansvc\\" or FolderPath contains ":\\Windows\\System32\\Com\\dmp\\" or FolderPath contains ":\\Windows\\System32\\FxsTmp\\" or FolderPath contains ":\\Windows\\System32\\Microsoft\\Crypto\\RSA\\MachineKeys\\" or FolderPath contains ":\\Windows\\System32\\Speech\\" or FolderPath contains ":\\Windows\\System32\\spool\\drivers\\color\\" or FolderPath contains ":\\Windows\\System32\\spool\\PRINTERS\\" or FolderPath contains ":\\Windows\\System32\\spool\\SERVERS\\" or FolderPath contains ":\\Windows\\System32\\Tasks_Migrated\\Microsoft\\Windows\\PLA\\System\\" or FolderPath contains ":\\Windows\\System32\\Tasks\\" or FolderPath contains ":\\Windows\\SysWOW64\\Com\\dmp\\" or FolderPath contains ":\\Windows\\SysWOW64\\FxsTmp\\" or FolderPath contains ":\\Windows\\SysWOW64\\Tasks\\") and (not((FolderPath contains "\\AppData\\" and AccountName =~ "SYSTEM")))


```

